import React from "react";
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/components/ui/accordion";

const questions = [
  {
    title: "𝐈𝐧𝐤𝐚𝐦 কি?",
    answer:
      "ইনকাম হলো বাংলাদেশের সর্বপ্রথম ডিজিটাল পণ্যের Distribution প্ল্যাটফর্ম। যেকোনো বাংলাদেশী নাগরিক এই প্ল্যাটফর্মটিতে রেজিস্ট্রেশন করতে পারবেন এবং প্ল্যাটফর্ম এ থাকা ডিজিটাল পণ্য ইচ্ছামত বিক্রি করে পাবেন নির্ধারিত সেলস কমিশন।",
  },
  {
    title: "ইনকাম অ্যাপটি কাদের জন্য?",
    answer:
      "আপনি যদি চান একজন উদ্দোগতা হতে কিন্তু পারফেক্ট উপায় পাচ্ছেন নাহ অথবা চাকরীর পাশাপাশি এক্সট্রা উপারজনের পথ খুঁজছেন কিংবা আপনি চান আপনার পড়াশুনার খরচ নিজেই জোগাবেন তাহলে ইনকাম অ্যাপটি আপনার জন্য।",
  },
  {
    title: "ইনকামে এজেন্ট কেন হবেন?",
    answer: [
      "একজন ইনকাম এজেন্ট হবার সুবিধা হল এর সুবিধাজনক সময় বেছে নিয়ে কাজ করার স্বাধীনতা। এছাড়া ইনকামে রয়েছে বিশাল ক্যাটাগরির ডিজিটাল সুবিধা বা পণ্য। সেগুলো থেকে আপনার পছন্দের কাজ আপনি বেছে নিতে পারবেন এবং যে কোন সময় যেকোনো জায়গা থেকে ইনকাম অ্যাপ এর ডিজিটাল পণ্য/সেবা মানুষের নিকটে পৌঁছে দিয়ে কিংবা ঘরে বসে রেফার করে টাকা ইনকাম করতে পারবেন। এতে করে যে কেউ উপার্জন করে নিজের আর্থিক ও আর্থসামাজিক অবস্থার উন্নতি ঘটাতে পারেন। আপনার উপার্জিত টাকা কাজ করার ৭ দিন পর আপনার অ্যাকাউন্টে যুক্ত হবে। ইন্সটেন্টলি আপনি সেটা উইথড্র করতে পারবেন।",
    ],
  },
  {
    title: "ইনকাম কেন অন্যান্য প্লাটফর্ম থেকে আলাদা?",
    answer: [
      "ইনকামে কাজ করে অর্থের পাশাপাশি অর্জন করুন সেলস, হিউম্যান রিসোর্স, এবং ভবিষ্যতে ইনকামের টেরিটরি ম্যানেজার হিসাবে নিজের টিম পরিচালনা করে আরও প্রতিষ্ঠিত ঙ্করার সুযোগ পাবেন।",
    ],
  },
  {
    title: "কিভাবে 𝐈𝐧𝐤𝐚𝐦 𝐀𝐩𝐩 এ রেজিস্ট্রেশন করবো?",
    answer: [
      "ভিজিট করুন inkam.app এই লিঙ্কটিতে। ওয়েবসাইট এর শুরুতেই Registration বাটনে ক্লিক করুন। আপনাকে Registration এর ধাপ গুলো তে নিয়ে যাওয়া হবে।",
      " # প্রথম ধাপে আপনার পুরো নামটি (Full Name) টাইপ করুন, এবং টাইপ শেষে Next বাটনে ক্লিক করুন।",
      " # দ্বিতীয় ধাপে আপনার ১১ ডিজিটের মোবাইল নম্বরটি (Mobile number) টাইপ করুন, এবং টাইপ শেষে Next বাটনে ক্লিক করুন।",
      " # তৃতীয় ধাপে আপনার দেয়া মোবাইল নম্বরে একটি ৪ সংখ্যার ওটিপি (OTP) যাবে। ওটিপি টি টাইপ করুন এবং Next বাটনে ক্লিক করুন।",
      "# চতুর্থ ধাপে আপনার ইমেইল আইডি (Email ID) টাইপ করুন, এবং Next বাটনে ক্লিক করুন।",
      "# পঞ্চম ধাপে একটি ৬ সংখ্যার পিন (PIN) টাইপ করুন এবং পরবর্তীতে ড্যাশবোর্ডে প্রবেশের জন্য পিন টি মনে রাখুন।",
      "এই পাঁচটি ধাপ সঠিক ভাবে সম্পন্ন হলে আপনাকে আপনার অ্যাফিলিয়েট ড্যাশবোর্ডে নিয়ে যাওয়া হবে এবং inkam এ আপনার Registration সম্পূর্ণ হবে।",
    ],
  },
];

const FAQs = () => {
  return (
    <div className="container max-w-7xl mx-auto my-12">
      <h2 className="text-3xl md:text-center font-bold uppercase pb-4">{`FAQ (সাধারন প্রশ্নাবলী)`}</h2>
      <div>
        <Accordion type="single" collapsible>
          {questions.map((faq) => (
            <AccordionItem
              key={faq.title}
              value={faq.title}
              className="text-left"
            >
              <AccordionTrigger>{faq.title}</AccordionTrigger>
              <AccordionContent>
                {typeof faq.answer === "string"
                  ? faq.answer
                  : faq.answer.map((a) => (
                      <p className="" key={a}>
                        {a}
                      </p>
                    ))}
              </AccordionContent>
            </AccordionItem>
          ))}
        </Accordion>
      </div>
    </div>
  );
};

export default FAQs;
